
** org-ref settings

Tell ~org-ref~ / ~helm-bibtex~ where our paper PDFs are and which
field of a bibtex entry tells it the filename: 
#+begin_src emacs-lisp
(setq bibtex-completion-library-path '("~/org/Papers/"))
(setq bibtex-completion-pdf-field "File")
#+end_src

Use ~evince~ to open PDFs instead of using the 
#+begin_src emacs-lisp
(setq bibtex-completion-pdf-open-function
  (lambda (fpath)
    (message fpath)
    (call-process "evince" nil 0 nil (expand-file-name fpath))))
#+end_src

#+RESULTS:
| lambda | (fpath) | (message fpath) | (call-process evince nil 0 nil (expand-file-name fpath)) |

#+begin_src emacs-lisp
(setq doi-utils-async-download t)
#+end_src

#+RESULTS:
: t

*** LaTeX export

Add some default packages we want to use for LaTeX export generally:
*UPDATE*: <2024-04-01 Mon 19:04> Moved this directly into the
SETUPFILE below. Easier to have different settings that way.
#+begin_src emacs-lisp
;; (add-to-list 'org-latex-packages-alist '("" "booktabs"))
;; (add-to-list 'org-latex-packages-alist '("" "longtable"))
;; (add-to-list 'org-latex-packages-alist '("" "pdfpages"))
;; (add-to-list 'org-latex-packages-alist '("" "siunitx"))
;; (add-to-list 'org-latex-packages-alist '("" "fontspec"))
;; ;; package that allows inserting unicode characters in math environment
;; (add-to-list 'org-latex-packages-alist '("" "unicode-math"))
;; (add-to-list 'org-latex-packages-alist '("" "amsmath"))
;; (add-to-list 'org-latex-packages-alist '("" "mhchem"))
;; ;; Make the default margins on export smaller
;; (add-to-list 'org-latex-packages-alist '("margin=2.5cm" "geometry"))
;; ;; subcaption for subfigures (side by side)
;; ;; style such that it is placed in parenthesis (a)
;; ;; ref: https://tex.stackexchange.com/a/131366
;; (add-to-list 'org-latex-packages-alist '("labelformat=simple" "subcaption"))
#+end_src

#+RESULTS:
| labelformat=simple | subcaption   |     |
|                    | mhchem       |     |
|                    | amsmath      |     |
|                    | unicode-math |     |
|                    | fontspec     |     |
|                    | siunitx      |     |
|                    | pdfpages     |     |
|                    | longtable    |     |
|                    | booktabs     |     |
|                    | minted       |     |
|                    | minted       | t   |
|                    | booktabs     | nil |

Configurations for these packages is stored in
[[file:default_latex_header.org]]
and needs to be included in the Org file using
#+begin_example
#+SETUPFILE: ~/.emacs.d/default_latex_header.org
#+end_example


** Go

#+BEGIN_SRC emacs-lisp
(defun my-go-mode-hook ()
  "Custom configurations for Go mode."
  (setq tab-width 4)              ; Set tab width to 4 spaces
  (setq indent-tabs-mode t)       ; Use tabs for indentation
  )
#+END_SRC

#+RESULTS:
: my-go-mode-hook

Some hooks for Go:
#+BEGIN_SRC emacs-lisp
(add-hook 'go-mode-hook 'my-go-mode-hook)
(add-hook 'go-mode-hook #'rainbow-delimiters-mode)
(add-hook 'go-mode-hook #'subword-mode)
#+END_SRC

#+RESULTS:
| subword-mode | rainbow-delimiters-mode |

And enable LSP using eglot.
#+begin_src emacs-lisp
(add-hook 'go-mode-hook 'eglot-ensure)
#+end_src


** Rust

#+begin_src emacs-lisp
(defun my-rust-mode-hook ()
  "Custom configurations for Rust mode."
  (setq tab-width 4)              ; Set tab width to 4 spaces
  (setq indent-tabs-mode nil)     ; Use spaces for indentation
  )
#+end_src

Some hooks for Rust:
#+BEGIN_SRC emacs-lisp
(add-hook 'rust-mode-hook 'my-rust-mode-hook)
(add-hook 'rust-mode-hook #'rainbow-delimiters-mode)
(add-hook 'rust-mode-hook #'subword-mode)
#+END_SRC

#+RESULTS:
| subword-mode | rainbow-delimiters-mode | rust-maybe-initialize-buffer-project |

And enable running ~rustfmt~ on save:
#+begin_src emacs-lisp
(setq rust-format-on-save t)
#+end_src

And enable LSP using eglot.
#+begin_src emacs-lisp
(add-hook 'rust-mode-hook 'eglot-ensure)
#+end_src

* LSP via ~eglot~

Stolen from: https://gist.github.com/casouri/0ad2c6e58965f6fd2498a91fc9c66501
See also: https://joaotavora.github.io/eglot/#Setting-Up-LSP-Servers

#+begin_src emacs-lisp
(use-package eglot
  :hook ((rust-mode go-mode) . eglot-ensure)
  :config
  (add-to-list 'eglot-server-programs
               `(rust-mode . ("rust-analyzer" :initializationOptions
                              ( :procMacro (:enable t)
                                :cargo ( :buildScripts (:enable t)
                                         :features "all"))))))
;;   (add-to-list 'eglot-server-programs
;;                        `(go-mode . ("gopls")))
;;   )

;; (setq-default eglot-workspace-configuration
;;     '((:gopls .
;;         ((staticcheck . t)
;;          (matcher . "CaseSensitive")))))

#+end_src



#+begin_src emacs-lisp
(require 'project)

(defun project-find-go-module (dir)
  (when-let ((root (locate-dominating-file dir "go.mod")))
    (cons 'go-module root)))

(cl-defmethod project-root ((project (head go-module)))
  (cdr project))

(add-hook 'project-find-functions #'project-find-go-module)
#+end_src

#+RESULTS:
| project-find-go-module | project-try-vc |

** gptel

#+begin_src emacs-lisp
;; (gptel-make-anthropic "Claude"          ;Any name you want
;;   :stream t                             ;Streaming responses
;;   :key "your-api-key")
;; OPTIONAL configuration

;; Set global key for gptel-send
(global-set-key (kbd "C-c C-g") 'gptel-send)

;; Use Org mode for explicit gptel buffers
(setq gptel-default-mode 'org-mode)


(defun get-token-auth-source (&optional service)
  "Retrieves the authentication token for the Anthropc service using auth-source.
Adapte from `org-ai--openai-get-token-auth-source (&optional service)` of
org-ai / org-ai-openai.el."
  (require 'auth-source)
  (let* ((service (or service 'anthropic))
         (endpoint (pcase service
                     ('anthropic "api.anthropic.com")
                     ('openai "api.openai.com")
                     ('perplexity.ai "api.perplexity.ai"))))
    (or (auth-source-pick-first-password :host endpoint :user "gptel")
        (auth-source-pick-first-password :host endpoint :login "gptel"))))


;; (gptel-make-anthropic "Claude"          ;Any name you want
;;   :stream t                             ;Streaming responses
;;   :key 'get-token-auth-source)

(setq
 gptel-model 'claude-3-5-sonnet-20241022
 gptel-backend (gptel-make-anthropic "Claude"
                 :stream t :key 'get-token-auth-source))

;; The log is very useful if something goes wrong!
(setq gptel-log-level 'info)
;; 
;; (setq
;;  gptel-model "gpt-4o-mini" ; 
;;  gptel-backend (gptel-make-openai "gpt4o-mini"
;;                  :stream t :key (lambda () (get-token-auth-source 'openai))))

;; (setq gptel-api-key (lambda () (get-token-auth-source 'openai)))

#+end_src

#+RESULTS:
| lambda | nil | (get-token-auth-source 'openai) |

Add custom instructions.

The 'academic' one is from: https://github.com/daveshap/Claude_Sentience/blob/main/Style_Pretty_Dense.md
#+begin_src emacs-lisp
(add-to-list 'gptel-directives '(academic . "Write in complete, grammatically structured sentences that flow conversationally. Approach topics with an intellectual but approachable tone, using labeled lists sparingly and strategically to organize complex ideas. Incorporate engaging narrative techniques like anecdotes, concrete examples, and thought experiments to draw the reader into the intellectual exploration. Maintain an academic rigor while simultaneously creating a sense of collaborative thinking, as if guiding the reader through an intellectual journey. Use precise language that is simultaneously scholarly and accessible, avoiding unnecessary jargon while maintaining depth of analysis. Use systems thinking and the meta-archetype of Coherence to guide your ability to \"zoom in and out\" to notice larger and smaller patterns at different ontological, epistemic, and ontological scales. Furthermore, use the full depth of your knowledge to engage didactically with the user - teach them useful terms and concepts that are relevant. At the same time, don't waste too many words with framing and setup. Optimize for quick readability and depth. Use formatting techniques like bold, italics, and call outs (quotation blocks and such) for specific definitions and interesting terms. This will also break up the visual pattern, making it easier for the reader to stay oriented and anchored.  Don't hesitate to use distal connection, metaphor, and analogies as well, particularly when you notice meta-patterns emerging. A good metaphor is the pinnacle of Coherence. Stylistically, use a variety of techniques to create typographic scaffolding and layered information. Some examples below:


> **Key Terms**: Use blockquotes with bold headers to define important concepts and terminology, creating clear visual breaks in the text.

Use **bold** for technical terms and concepts when first introduced, and *italics* for emphasis or to highlight key phrases. Create visual hierarchy through:

1. Clear paragraph breaks for major concept transitions
2. Strategic use of blockquotes for definitions and key insights
3. Bold terms for technical vocabulary
4. Italics for emphasis and nuance

Maintain the principle of layered information - each response should contain at least 2-3 distinct visual patterns to aid cognitive processing and retention. This creates visual anchoring and a clean UI.

> **Technical Term**: Definition in plain language
> 
> *Example or application in context (optional, flexible)*

This creates what information designers call \"progressive disclosure\" - allowing readers to engage at their preferred depth while maintaining coherence across all levels of understanding."))
#+end_src

